In [1]:
print ("Hello World")

Hello World

In [1]:
from pandas import Series
se = Series ([1,3,5,7,9])

In [2]:
se

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
se ['2']

KeyError: '2'

In [4]:
se[2]

5

In [5]:
5

5

In [6]:
se[1]

3

In [8]:
se2 = Series ([100, 200, 300], index=['a','b','c'])

In [9]:
se2

a    100
b    200
c    300
dtype: int64

In [10]:
se2['b']

200

In [11]:
salary = {'John': 3000, 'Tim': 4500, 'Rob':5600}

In [12]:
salary

{'John': 3000, 'Rob': 5600, 'Tim': 4500}

In [13]:
se3 = Series(salary)

In [14]:
se3

John    3000
Rob     5600
Tim     4500
dtype: int64

In [15]:
se3['Rob']

5600

In [2]:
data = {'Name': ['John', 'Rob', 'Neal']
       'Age': [32, 22, 29]
       'Salary': [4400, 5422, 9880]
       }

SyntaxError: invalid syntax (<ipython-input-2-1d6d120c5771>, line 2)

In [3]:
data = {'Name': ['John', 'Rob', 'Neal']
       'Age': [32, 22, 29]
       'Salary': [4400, 5422, 9880]
       }

SyntaxError: invalid syntax (<ipython-input-3-1d6d120c5771>, line 2)

In [4]:
data = {'Name': ['John', 'Rob', 'Neal'],
       'Age': [32, 22, 29],
       'Salary': [4400, 5422, 9880]
       }

In [5]:
from pandas import DataFrame

In [6]:
frame = DataFrame(data)

In [7]:
frame

   Age  Name  Salary
0   32  John    4400
1   22   Rob    5422
2   29  Neal    9880

In [11]:
newframe = DataFrame(data, columns= ['Name', 'Age', 'Salary', 'Profile'])

In [12]:
newframe

   Name  Age  Salary Profile
0  John   32    4400     NaN
1   Rob   22    5422     NaN
2  Neal   29    9880     NaN

In [13]:
newframe['Salary']

0    4400
1    5422
2    9880
Name: Salary, dtype: int64

In [14]:
newframe.ix['Rob']

/Users/adamemerson/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

KeyError: 'Rob'

In [15]:
newframe.ix[Rob]

NameError: name 'Rob' is not defined

In [16]:
newframe.ix[2]

Name       Neal
Age          29
Salary     9880
Profile     NaN
Name: 2, dtype: object

In [17]:
newframe['Profile']='Doctor'

In [18]:
newframe

   Name  Age  Salary Profile
0  John   32    4400  Doctor
1   Rob   22    5422  Doctor
2  Neal   29    9880  Doctor

In [19]:
newframe['Education'] = 'MS'

In [20]:
newframe

   Name  Age  Salary Profile Education
0  John   32    4400  Doctor        MS
1   Rob   22    5422  Doctor        MS
2  Neal   29    9880  Doctor        MS

In [21]:
newframe = newframe.T

In [22]:
newframe

                0       1       2
Name         John     Rob    Neal
Age            32      22      29
Salary       4400    5422    9880
Profile    Doctor  Doctor  Doctor
Education      MS      MS      MS

In [23]:
newframe = newframe.T
newframe

   Name Age Salary Profile Education
0  John  32   4400  Doctor        MS
1   Rob  22   5422  Doctor        MS
2  Neal  29   9880  Doctor        MS

In [24]:
from pandas import Series

In [27]:
obj = Series ([100,200,300,400,500], index = ['d','a','b','e','c'])

In [28]:
obj

d    100
a    200
b    300
e    400
c    500
dtype: int64

In [29]:
obj = obj.reindex(['a','b','c','d','e'])
obj

a    200
b    300
c    500
d    100
e    400
dtype: int64

In [30]:
data

{'Age': [32, 22, 29],
 'Name': ['John', 'Rob', 'Neal'],
 'Salary': [4400, 5422, 9880]}

In [31]:
frame1 = DataFrame(data)
frame

   Age  Name  Salary
0   32  John    4400
1   22   Rob    5422
2   29  Neal    9880

In [32]:
frame = frame.reindex[(0,2,1)]
frame

TypeError: 'method' object is not subscriptable

In [33]:
frame1 = frame.reinsex([0,2,1])

AttributeError: 'DataFrame' object has no attribute 'reinsex'

In [34]:
frame = frame.reindex([0,2,1])
frame

   Age  Name  Salary
0   32  John    4400
2   29  Neal    9880
1   22   Rob    5422

In [38]:
fields = ['Name', 'Age', 'Salary']
frame = frame.reindex(columns=fields)
frame

   Name  Age  Salary
0  John   32    4400
2  Neal   29    9880
1   Rob   22    5422

In [39]:
frame

   Name  Age  Salary
0  John   32    4400
2  Neal   29    9880
1   Rob   22    5422

In [41]:
fram = frame.drop([2])

In [42]:
from

SyntaxError: invalid syntax (<ipython-input-42-a0531db54fa8>, line 1)

In [43]:
frame

   Name  Age  Salary
0  John   32    4400
2  Neal   29    9880
1   Rob   22    5422

In [44]:
frame = frame.drop([2])

In [45]:
frame

   Name  Age  Salary
0  John   32    4400
1   Rob   22    5422